####################################################
# Version: v1.0.0.0
# Date: 2020.02.20
# Author: Xia Xianba
# Contact: 778757080@qq.com
# File: linear_regression.R
# Describe:
#    1.线性回归分析
####################################################

####################################################
# 重置环境
rm(list=ls())

# 因变量和自变量数据
x <- c(0.10,0.11,0.12,0.13,0.14,0.15,0.16,0.17,0.18,0.20,0.21,0.23)
y <- c(42.0,43.5,45.0,45.5,45.0,47.5,49.0,53.0,50.0,55.0,55.0,60.0)

# 对线性回归进行建模
z <- lm(y~x+1)
summary(z)

# 对模型进行预测和验证
point <- data.frame(x=0.16)
predict(z,point,interval="prediction",level=0.95)

# 进行图形分析
plot(x,y)
lines(x,fitted(z))
